#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/devgio/personal-pwa/runs/run-E9PzdoujohBpumTF

Waiting for the plan to start...

Terraform v1.1.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_id.id: Refreshing state... [id=wE-tJw]
google_project.project: Refreshing state... [id=projects/personal-pwa-1c04fad27]
google_project_service.service["compute.googleapis.com"]: Refreshing state... [id=personal-pwa-1c04fad27/compute.googleapis.com]
google_compute_network.default: Refreshing state... [id=projects/personal-pwa-1c04fad27/global/networks/default-network]
google_compute_instance.default: Refreshing state... [id=projects/personal-pwa-1c04fad27/zones/europe-west6-a/instances/tf-compute-1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_compute_instance.default has changed
  ~ resource "google_compute_instance" "default" {
        id                        = "projects/personal-pwa-1c04fad27/zones/europe-west6-a/instances/tf-compute-1"
      + labels                    = {}
      + metadata                  = {}
        name                      = "tf-compute-1"
      + resource_policies         = []
      + tags                      = []
        # (16 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.default will be created
  + resource "google_compute_firewall" "default" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "default-firewall"
      + network            = "default-network"
      + priority           = 1000
      + project            = "personal-pwa-1c04fad27"
      + self_link          = (known after apply)
      + source_tags        = [
          + "web",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "80",
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_ssl_certificate.default will be created
  + resource "google_compute_ssl_certificate" "default" {
      + certificate        = (sensitive value)
      + certificate_id     = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + name_prefix        = "main"
      + private_key        = (sensitive value)
      + project            = "personal-pwa-1c04fad27"
      + self_link          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @devgioele*